Revit 2024 API
ExternalServiceRegistry.GetServices Method
 Returns a collection of all external services currently registered in Revit.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static IList<ExternalService> GetServices()
Visual Basic
Public Shared Function GetServices As IList(Of ExternalService)
Visual C++
public:
static IList<ExternalService^>^ GetServices()
Return Value
 Array of ExternalService instances.
See Also
ExternalServiceRegistry Class
Autodesk.Revit.DB.ExternalService Namespace